## **Questions based on Titanic Dataset:**

To read the dataset as csv, use the below code:

```python
import pandas as pd

url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQjh5HzZ1N0SU7ME9ZQRzeVTaXaGsV97rU8R7eAcg53k27GTstJp9cRUOfr55go1GRRvTz1NwvyOnuh/pub?gid=1562145139&single=true&output=csv"
titanic_df = pd.read_csv(url)
```

### `Q-1:` Using `groupby` make groups using the `"Pclass"` column and find out the average age and total number of missing values in the `"Age"` column for every group.

In [3]:
import pandas as pd

url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQjh5HzZ1N0SU7ME9ZQRzeVTaXaGsV97rU8R7eAcg53k27GTstJp9cRUOfr55go1GRRvTz1NwvyOnuh/pub?gid=1562145139&single=true&output=csv"
titanic_df = pd.read_csv(url)
titanic_df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:

grouped = titanic_df.groupby('Pclass')
avg_age = grouped['Age'].mean().rename('AverageAge')
missing_age = grouped['Age'].apply(lambda x: x.isna().sum()).rename('MissingAgeCount')

result = pd.concat([avg_age, missing_age], axis=1)
result

        AverageAge  MissingAgeCount
Pclass
1        38.233441               30
2        29.877630               11
3        25.140620              136

### `Q-2:` Using `groupby` make groups using the `"Pclass"` column and fill every group's `"Embarked"` column's missing values with the mode value of that group. After that, print every group's `"Embarked"` column's value counts in ascending order.

In [9]:

titanic_df.Embarked.isna().sum()

2

In [10]:
mode=titanic_df["Embarked"].value_counts().idxmax()
mode

'S'

In [5]:
titanic_df.groupby("Pclass")["Embarked"].fillna(mode).value_counts(ascending=False)

C:\Users\DELL\AppData\Local\Temp\ipykernel_27136\450408789.py:1: FutureWarning: SeriesGroupBy.fillna is deprecated and will be removed in a future version. Use obj.ffill() or obj.bfill() for forward or backward filling instead. If you want to fill with a single value, use Series.fillna instead
  titanic_df.groupby("Pclass")["Embarked"].fillna(mode).value_counts(ascending=False)

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

### `Q-3:` Make groups based on `"Embarked"` column. And for each of this embarked group, make another group based on `"Pclass"` and find out the average fare (round off up to 2 decimal places) for each "Pclass" for each group of "Embarked".

**Sample Output:**

```bash
{'C': {1: 105, 2: 25, 3: 11},
 'Q': {1: 90, 2: 12, 3: 11},
 'S': {1: 70, 2: 20, 3: 15}}
```

In [13]:
df=titanic_df.groupby(["Pclass","Embarked"])['Fare'].mean().round(2)
df

Pclass  Embarked
1       C           104.72
        Q            90.00
        S            70.36
2       C            25.36
        Q            12.35
        S            20.33
3       C            11.21
        Q            11.18
        S            14.64
Name: Fare, dtype: float64

In [14]:
df.unstack().to_dict()

{'C': {1: 104.72, 2: 25.36, 3: 11.21},
 'Q': {1: 90.0, 2: 12.35, 3: 11.18},
 'S': {1: 70.36, 2: 20.33, 3: 14.64}}

## **Questions Based on Fifa Worldcup - 2022 Dataset:**

You can read the dataset by using the below sample code

```python
import pandas as pd

fifa_df = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT3D_x_4DS6d51LKJ7ze1sxT5WpV5uiSVOFYHLwBiGru6vFyVv5h5-83AwFjxWYiWfCDjDAaarHAV-k/pub?gid=0&single=true&output=csv")
```

In [9]:
import pandas as pd

fifa_df = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT3D_x_4DS6d51LKJ7ze1sxT5WpV5uiSVOFYHLwBiGru6vFyVv5h5-83AwFjxWYiWfCDjDAaarHAV-k/pub?gid=0&single=true&output=csv")
fifa_df.head(2)

,Sl. No,Match No.,Team,Against,Group,Goal,Possession (%),Inside Penalty Area,Outside Penalty Area,Assists,...,Fouls Against,Offsides,Passes,Passes Completed,Crosses,Crosses Completed,Corners,Free Kicks,Penalties Scored,Pts
0,1,1,Qatar,Ecuador,A,0,40,0,0,0,...,15,3,453,387,10,5,1,19,0,0
1,2,1,Ecuador,Qatar,A,2,46,2,0,1,...,15,4,484,419,26,10,3,17,1,3

### `Q-4:` Perform `groupby` based on the `"Team"` column and then perform Z Normalization on top of the below columns of each group:
1. Passes
2. Passes Completed
3. Attempted Line Breaks
4. Completed Line Breaks

You have to make a python function named `z_normalization` which takes two arguments:

1. *group:* Every group that you have created
2. *cols_to_perform:* This parameter takes a list of columns on which you have to perform the Z-Normalization.

For this problem, you have to use th `apply()` method.

$\Large Z \ - \ Normalization = \frac{X_i - \mu}{std} $

After that find out the below values for each group:
- minimum "Passess"
- maximum "Passess"
- minimum "Yellow Cards"
- maximum "Yellow cards"
- average "Yellow Cards"
- maximum "Attempted Line Breaks"
- minimum "Attempted Line Breaks"
- standardard deviation of "Attempted Line Breaks"
- average Possession

In [2]:
def nrml(grp,col_name):
    df=fifa_df.groupby(grp)[col_name].apply(lambda x:(x-x.mean())/x.std())
    return df

In [3]:
print(nrml("Team",'Passes Completed'))

Team
Argentina  8     -0.157888
           46    -0.574048
           77     1.813757
           98     0.592566
           115   -0.253400
                    ...
Uruguay    63    -0.894617
           89    -0.184945
Wales      7     -0.139325
           32     1.062357
           68    -0.923031
Name: Passes Completed, Length: 128, dtype: float64

In [20]:
print(nrml("Team",'Passes'))

Team
Argentina  8     -0.208138
           46    -0.630447
           77     1.685214
           98     0.622403
           115   -0.137753
                    ...
Uruguay    63    -0.931702
           89    -0.124867
Wales      7     -0.054584
           32     1.026174
           68    -0.971590
Name: Passes, Length: 128, dtype: float64

In [22]:
print(nrml("Team",'Attempted Line Breaks') )

Team
Argentina  8      0.364745
           46    -0.795806
           77    -1.027917
           98     0.003684
           115    0.571065
                    ...
Uruguay    63    -0.484182
           89     1.149932
Wales      7      0.226294
           32     0.867461
           68    -1.093756
Name: Attempted Line Breaks, Length: 128, dtype: float64

In [23]:
print(nrml("Team",'Completed Line Breaks'))

Team
Argentina  8      0.087403
           46    -0.945040
           77     0.049164
           98     0.393311
           115   -0.103791
                    ...
Uruguay    63    -0.623480
           89     1.153437
Wales      7      0.195342
           32     0.887916
           68    -1.083258
Name: Completed Line Breaks, Length: 128, dtype: float64

In [19]:
df=fifa_df.groupby("Team").agg({'Passes':['min','max'], 'Yellow Cards':['min','max'],'Attempted Line Breaks':['max','min','std'],'Possession (%)':['mean']})
df.head(4)

          Passes      Yellow Cards     Attempted Line Breaks                  \
             min  max          min max                   max  min        std
Team
Argentina    408  862            0   8                   249  141  38.774685
Australia    286  466            0   3                   171  133  17.682383
Belgium      512  685            1   3                   195  167  14.422205
Brazil       548  695            0   3                   193  164  10.691118

          Possession (%)
                    mean
Team
Argentina      49.285714
Australia      31.250000
Belgium        49.000000
Brazil         50.400000

## **Questions on IPL wala dataset**

ball by ball dataset - https://drive.google.com/file/d/1-kvv_9KCSAFWcrhS9WgTxSrURkRh6GNt/view?usp=share_link

###`Q-5:` Find batsman in below category-
* Highest score while chasing
* Best Strike rate while chasing and have faced 100+ balls


> Chasing mean team batting in second inning

In [54]:
ipl=pd.read_csv('IPL_Ball_by_Ball_2008_2022.csv')
ipl.head(2)

,ID,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam
0,1312200,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals
1,1312200,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals

In [67]:
ipl.columns

Index(['ID', 'innings', 'overs', 'ballnumber', 'batter', 'bowler',
       'non-striker', 'extra_type', 'batsman_run', 'extras_run', 'total_run',
       'non_boundary', 'isWicketDelivery', 'player_out', 'kind',
       'fielders_involved', 'BattingTeam'],
      dtype='object')

In [23]:
ipl[ipl['innings']==2].groupby('batter')['batsman_run'].sum().idxmax()

'V Kohli'

In [41]:
ball_played=ipl['batter'].value_counts()

In [51]:
df=ipl[ipl['innings']==2].groupby('batter')['batsman_run'].sum().reset_index(name='Total_run').merge(ball_played,on='batter')
df['strike_rate']=((df['Total_run']/df['count'])*100).round(2)
df[df['count']>100].sort_values(by='strike_rate',ascending=False).head(4)

        batter  Total_run  count  strike_rate
458  SM Katich        230    191       120.42
219  K Gowtham        136    115       118.26
113   D Brevis        120    116       103.45
326   N Pooran        632    630       100.32

###`Q-6` Most Successful bowler against any batsman. Find that pair of bowler and batsman.
> Most Successful in terms of dissmissal. A bowler who have dissmissed any batsman most no of times. If any two pairs have same no of dissmisal, consider runs conceded by bowler to that batsman. Those who have concede lesser runs is more successful.

In [43]:
ipl.groupby(['bowler','batter'])[['isWicketDelivery','batsman_run']].sum().sort_values(by=['isWicketDelivery','batsman_run'],ascending=False)

                            isWicketDelivery  batsman_run
bowler         batter
SP Narine      RG Sharma                   8          137
R Ashwin       RV Uthappa                  7          123
PP Ojha        MS Dhoni                    7           98
A Mishra       RG Sharma                   7           87
Sandeep Sharma V Kohli                     7           78
...                                      ...          ...
Yash Dayal     MM Ali                      0            0
Yuvraj Singh   PC Valthaty                 0            0
Z Khan         A Zampa                     0            0
               MJ Lumb                     0            0
               PR Shah                     0            0

[24213 rows x 2 columns]

###`Q-7`: Most successful batting pair in IPL. Batting pair who have scored most runs playing together.

In [60]:
ipl.groupby(['batter','non-striker'])['batsman_run'].sum().sort_values(ascending=False).idxmax()

('AB de Villiers', 'V Kohli')

###`Q-8:` Make a dataframe for all batting pairs played together.
```
Batsman1 Batsman2 Runs Avg StrikeRate
```

> Just to ease this question you can count wide-balls for strike rate.

In [55]:
df=ipl.groupby(['batter','non-striker']).agg({'batsman_run':['sum','mean']}).reset_index()
df.columns=['batter','non-striker','Total_run','Avg']
df.head(4)

           batter      non-striker  Total_run       Avg
0  A Ashish Reddy         A Mishra         19  1.266667
1  A Ashish Reddy  AA Jhunjhunwala          3  1.000000
2  A Ashish Reddy         CL White          3  1.000000
3  A Ashish Reddy     DB Ravi Teja          6  2.000000

In [56]:
count=ipl.groupby(['batter','non-striker'])['ballnumber'].count().reset_index(name='Total_ball')
count

              batter      non-striker  Total_ball
0     A Ashish Reddy         A Mishra          15
1     A Ashish Reddy  AA Jhunjhunwala           3
2     A Ashish Reddy         CL White           3
3     A Ashish Reddy     DB Ravi Teja           3
4     A Ashish Reddy        DJG Sammy          18
...              ...              ...         ...
8057          Z Khan        S Aravind           2
8058          Z Khan         S Nadeem           5
8059          Z Khan       SL Malinga           8
8060          Z Khan     SR Tendulkar           3
8061          Z Khan        SS Tiwary          25

[8062 rows x 3 columns]

In [58]:

df=df.merge(count,on=['batter','non-striker'])
df.head(3)

,batter,non-striker,Total_run,Avg,Total_ball_x,Total_ball_y
0,A Ashish Reddy,A Mishra,19,1.266667,15,15
1,A Ashish Reddy,AA Jhunjhunwala,3,1.000000,3,3
2,A Ashish Reddy,CL White,3,1.000000,3,3

In [59]:
df['StrikeRate']=(df['Total_run']/df['Total_ball_x'])*100
df.head(5)

,batter,non-striker,Total_run,Avg,Total_ball_x,Total_ball_y,StrikeRate
0,A Ashish Reddy,A Mishra,19,1.266667,15,15,126.666667
1,A Ashish Reddy,AA Jhunjhunwala,3,1.000000,3,3,100.000000
2,A Ashish Reddy,CL White,3,1.000000,3,3,100.000000
3,A Ashish Reddy,DB Ravi Teja,6,2.000000,3,3,200.000000
4,A Ashish Reddy,DJG Sammy,26,1.444444,18,18,144.444444